org/2023-06-13-Guix_Dive.org
#+OPTIONS: toc:nil num:nil
#+BEGIN_EXPORT html
---
layout: post
title: Diving into the Guix internals
permalink: /:title/
tags: [guix, scheme]
---
#+END_EXPORT
One of the great things about Guix is that it uses Scheme (Guile specifically) as its implementation language.
Due to the functional design of the system this decision actually impacts not only developers, but also users of Guix and Guix System, so the language choice is a lot more important here than in other projects.
What's great about Scheme is that it's an established language with an existing ecosystem and tooling. What's more than that, is that it also has a very functional REPL, which can be integrated with Emacs using Geiser.
The usability of this tooling extends all the way to almost all parts of the Guix source - this means I can take it apart piece by piece using the existing tools, which is very convenient.
This realization is actually where my idea to "dive in" with a REPL was born.

Let's spin up Emacs and get hacking!

* The setup
So of course before any hacking begins I'll have to prepare my Emacs environment for the task. There's a few steps I need to take, though all of them pretty straightforward.

Most of the steps here are taken right from the Guix manual, see https://guix.gnu.org/en/manual/en/guix.html#The-Perfect-Setup.

I'll first need to set up all the necessary dependencies - fortunately Guix makes this very straightforward.
#+begin_src bash
  guix install guix guile
#+end_src

Next I'll need the actual Guix development repositories cloned locally, this is a quick process too.
#+begin_src bash
  cd $HOME
  git clone https://git.savannah.gnu.org/git/guix.git
#+end_src

Finally I could set up Geiser inside Emacs. Here I use the path I cloned the repository to, ~$HOME/guix~ in my case.
#+begin_src emacs-lisp
  (with-eval-after-load 'geiser-guile
    (add-to-list 'geiser-guile-load-path "~/guix"))
#+end_src

I'll also compile all the Guix files now, so I can work in the REPL uninterrupted by compiles. I can use ~guix shell~ to ensure I have the fully correct development environment.
#+begin_src bash
  cd ~/guix
  guix shell -D guix --pure
  ./bootstrap
  make clean
  make -j10
  exit # leave the Guix shell
#+end_src
This takes a while but finishes successfully eventually.

I also have a couple of my own little modules for Guix as well as nonguix, but since I won't be diving into these I won't bother cloning them now.

