_posts/2023-06-13-Guix_Dive.html
---
layout: post
title: Diving into the Guix internals
permalink: /:title/
tags: [guix, scheme]
---
<p>
One of the great things about Guix is that it uses Scheme (Guile specifically) as its implementation language.
Due to the functional design of the system this decision actually impacts not only developers, but also users of Guix and Guix System, so the language choice is a lot more important here than in other projects.
What's great about Scheme is that it's an established language with an existing ecosystem and tooling. What's more than that, is that it also has a very functional REPL, which can be integrated with Emacs using Geiser.
The usability of this tooling extends all the way to almost all parts of the Guix source - this means I can take it apart piece by piece using the existing tools, which is very convenient.
This realization is actually where my idea to "dive in" with a REPL was born.
</p>

<p>
Let's spin up Emacs and get hacking!
</p>

<div id="outline-container-org37a4733" class="outline-2">
<h2 id="org37a4733">The setup</h2>
<div class="outline-text-2" id="text-org37a4733">
<p>
So of course before any hacking begins I'll have to prepare my Emacs environment for the task. There's a few steps I need to take, though all of them pretty straightforward.
</p>

<p>
Most of the steps here are taken right from the Guix manual, see <a href="https://guix.gnu.org/en/manual/en/guix.html#The-Perfect-Setup">https://guix.gnu.org/en/manual/en/guix.html#The-Perfect-Setup</a>.
</p>

<p>
I'll first need to set up all the necessary dependencies - fortunately Guix makes this very straightforward.
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #006DAF;">guix</span> install guix guile
</pre>
</div>

<p>
Next I'll need the actual Guix development repositories cloned locally, this is a quick process too.
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #006FE0;">cd</span> <span style="color: #0000FF;">$</span><span style="color: #D0372D; font-style: italic;">HOME</span>
<span style="color: #006DAF;">git</span> clone https://git.savannah.gnu.org/git/guix.git
</pre>
</div>

<p>
Finally I could set up Geiser inside Emacs. Here I use the path I cloned the repository to, <code>$HOME/guix</code> in my case.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #707183;">(</span><span style="color: #0000FF;">with-eval-after-load</span> 'geiser-guile
  <span style="color: #7388D6;">(</span>add-to-list 'geiser-guile-load-path <span style="color: #008000;">"~/guix"</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
I'll also compile all the Guix files now, so I can work in the REPL uninterrupted by compiles. I can use <code>guix shell</code> to ensure I have the fully correct development environment.
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #006FE0;">cd</span> ~/guix
<span style="color: #006DAF;">guix</span> shell <span style="color: #D0372D;">-D</span> guix <span style="color: #D0372D;">--pure</span>
<span style="color: #006DAF;">./bootstrap</span>
<span style="color: #006DAF;">make</span> clean
<span style="color: #006DAF;">make</span> <span style="color: #D0372D;">-j10</span>
<span style="color: #006DAF;">exit</span> <span style="color: #8D8D84; font-style: italic;"># leave the Guix shell</span>
</pre>
</div>
<p>
This takes a while but finishes successfully eventually.
</p>

<p>
I also have a couple of my own little modules for Guix as well as nonguix, but since I won't be diving into these I won't bother cloning them now.
</p>
</div>
</div>
