_posts/2023-06-13-Guix_Dive.html

<div id="outline-container-org26d0406" class="outline-2">
<h2 id="org26d0406">The starting point</h2>
<div class="outline-text-2" id="text-org26d0406">
<p>
So where exactly does one start hacking on such a complex project? Well I decided to start with the part I was already most familiar with - the Guix System configuration. Here's my current configuration for reference (yes, it's a little lengthy!).
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #707183;">(</span>add-to-load-path <span style="color: #008000;">"/etc/guix-modules"</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #0000FF;">use-modules</span> <span style="color: #7388D6;">(</span>gnu<span style="color: #7388D6;">)</span>
             <span style="color: #7388D6;">(</span>gnu services<span style="color: #7388D6;">)</span>
             <span style="color: #7388D6;">(</span>gnu services dbus<span style="color: #7388D6;">)</span>
             <span style="color: #7388D6;">(</span>gnu packages gnome<span style="color: #7388D6;">)</span>
             <span style="color: #7388D6;">(</span>nongnu packages linux<span style="color: #7388D6;">)</span>
             <span style="color: #7388D6;">(</span>nongnu system linux-initrd<span style="color: #7388D6;">)</span>
             <span style="color: #7388D6;">(</span>gnu services virtualization<span style="color: #7388D6;">)</span>
             <span style="color: #7388D6;">(</span>gnu services shepherd<span style="color: #7388D6;">)</span>
             <span style="color: #7388D6;">(</span>gnu services admin<span style="color: #7388D6;">)</span>
             <span style="color: #7388D6;">(</span>guix channels<span style="color: #7388D6;">)</span>
             <span style="color: #7388D6;">(</span>gnu services mcron<span style="color: #7388D6;">)</span>
             <span style="color: #7388D6;">(</span>gnu services docker<span style="color: #7388D6;">)</span>
             <span style="color: #7388D6;">(</span>nil services mount-rshared<span style="color: #7388D6;">)</span>
             <span style="color: #7388D6;">(</span>nil packages gnome<span style="color: #7388D6;">)</span>
             <span style="color: #7388D6;">(</span>gnu packages fonts<span style="color: #7388D6;">)</span>
             <span style="color: #7388D6;">(</span>gnu packages networking<span style="color: #7388D6;">)</span>
             <span style="color: #7388D6;">(</span>guix gexp<span style="color: #7388D6;">)</span>
             <span style="color: #7388D6;">(</span>guix packages<span style="color: #7388D6;">)</span>
             <span style="color: #7388D6;">(</span>srfi srfi-1<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>use-service-modules linux desktop networking ssh xorg<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>use-package-modules linux package-management<span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #0000FF;">define</span> <span style="color: #006699;">%my-services</span>
  <span style="color: #7388D6;">(</span>modify-services %desktop-services
                   <span style="color: #909183;">(</span>delete gdm-service-type<span style="color: #909183;">)</span>
                   <span style="color: #909183;">(</span>guix-service-type config =&gt; <span style="color: #709870;">(</span>guix-configuration
                                                 <span style="color: #907373;">(</span>inherit config<span style="color: #907373;">)</span>
                                                 <span style="color: #907373;">(</span>substitute-urls
                                                  <span style="color: #6276BA;">(</span>append <span style="color: #858580;">(</span>list <span style="color: #008000;">"https://substitutes.nonguix.org"</span><span style="color: #858580;">)</span>
                                                          %default-substitute-urls<span style="color: #6276BA;">)</span><span style="color: #907373;">)</span>
                                                 <span style="color: #907373;">(</span>authorized-keys
                                                  <span style="color: #6276BA;">(</span>append <span style="color: #858580;">(</span>list <span style="color: #80A880;">(</span>local-file <span style="color: #008000;">"./signing-key.pub"</span><span style="color: #80A880;">)</span><span style="color: #858580;">)</span>
                                                          %default-authorized-guix-keys<span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
                   <span style="color: #909183;">(</span>dbus-root-service-type config =&gt;
                                           <span style="color: #709870;">(</span>dbus-configuration <span style="color: #907373;">(</span>inherit config<span style="color: #907373;">)</span>
                                                               <span style="color: #907373;">(</span>services <span style="color: #6276BA;">(</span>list libratbag blueman<span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span>operating-system

 <span style="color: #7388D6;">(</span>locale <span style="color: #008000;">"cs_CZ.utf8"</span><span style="color: #7388D6;">)</span>
 <span style="color: #7388D6;">(</span>timezone <span style="color: #008000;">"Europe/Prague"</span><span style="color: #7388D6;">)</span>
 <span style="color: #7388D6;">(</span>keyboard-layout <span style="color: #909183;">(</span>keyboard-layout <span style="color: #008000;">"cz"</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>

 <span style="color: #7388D6;">(</span>host-name <span style="color: #008000;">"eternity"</span><span style="color: #7388D6;">)</span>

 <span style="color: #7388D6;">(</span>kernel linux<span style="color: #7388D6;">)</span>
 <span style="color: #7388D6;">(</span>initrd microcode-initrd<span style="color: #7388D6;">)</span>
 <span style="color: #7388D6;">(</span>firmware <span style="color: #909183;">(</span>list linux-firmware<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>

 <span style="color: #7388D6;">(</span>groups 
  <span style="color: #909183;">(</span>cons* 
   <span style="color: #709870;">(</span>user-group <span style="color: #907373;">(</span>name <span style="color: #008000;">"games"</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span> <span style="color: #8D8D84; font-style: italic;">;; </span><span style="color: #8D8D84; font-style: italic;">For libratbagd</span>
   <span style="color: #709870;">(</span>user-group <span style="color: #907373;">(</span>name <span style="color: #008000;">"realtime"</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
   %base-groups<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>

 <span style="color: #7388D6;">(</span>users <span style="color: #909183;">(</span>cons* <span style="color: #709870;">(</span>user-account
                <span style="color: #907373;">(</span>name <span style="color: #008000;">"nil"</span><span style="color: #907373;">)</span>
                <span style="color: #907373;">(</span>comment <span style="color: #008000;">"(lambda () nil)"</span><span style="color: #907373;">)</span>
                <span style="color: #907373;">(</span>group <span style="color: #008000;">"users"</span><span style="color: #907373;">)</span>
                <span style="color: #907373;">(</span>home-directory <span style="color: #008000;">"/home/nil"</span><span style="color: #907373;">)</span>
                <span style="color: #907373;">(</span>supplementary-groups
                 '<span style="color: #6276BA;">(</span><span style="color: #008000;">"wheel"</span> <span style="color: #008000;">"netdev"</span> <span style="color: #008000;">"audio"</span> <span style="color: #008000;">"video"</span> <span style="color: #008000;">"lp"</span> <span style="color: #008000;">"libvirt"</span> <span style="color: #008000;">"kvm"</span> <span style="color: #008000;">"games"</span> <span style="color: #008000;">"docker"</span> <span style="color: #008000;">"realtime"</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
               %base-user-accounts<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>

 <span style="color: #7388D6;">(</span>packages
  <span style="color: #909183;">(</span>append
   <span style="color: #709870;">(</span><span style="color: #0000FF;">map</span> specification-&gt;package
        <span style="color: #907373;">(</span>list
         <span style="color: #008000;">"nss-certs"</span>
         <span style="color: #008000;">"xf86-video-amdgpu"</span>
         <span style="color: #008000;">"amdgpu-firmware"</span>
         <span style="color: #008000;">"bluez"</span>
         <span style="color: #008000;">"blueman"</span>
         <span style="color: #008000;">"vim"</span>
         <span style="color: #008000;">"sway"</span>
         <span style="color: #008000;">"wofi"</span>
         <span style="color: #008000;">"libratbag"</span>
         <span style="color: #008000;">"git"</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
   %base-packages<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>

 <span style="color: #7388D6;">(</span>services
  <span style="color: #909183;">(</span>append
   <span style="color: #709870;">(</span>list
    <span style="color: #907373;">(</span>service gdm-service-type
             <span style="color: #6276BA;">(</span>gdm-configuration
              <span style="color: #858580;">(</span>wayland? #t<span style="color: #858580;">)</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span>
    <span style="color: #907373;">(</span>service bluetooth-service-type
             <span style="color: #6276BA;">(</span>bluetooth-configuration
              <span style="color: #858580;">(</span>auto-enable? #f<span style="color: #858580;">)</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span>

    mount-rshared-service

    <span style="color: #907373;">(</span>pam-limits-service
     <span style="color: #6276BA;">(</span>list <span style="color: #858580;">(</span>pam-limits-entry <span style="color: #008000;">"*"</span> 'hard 'nofile 524288<span style="color: #858580;">)</span>
           <span style="color: #858580;">(</span>pam-limits-entry <span style="color: #008000;">"@realtime"</span> 'both 'rtprio 99<span style="color: #858580;">)</span>
           <span style="color: #858580;">(</span>pam-limits-entry <span style="color: #008000;">"@realtime"</span> 'both 'memlock 'unlimited<span style="color: #858580;">)</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span>

    <span style="color: #907373;">(</span>extra-special-file <span style="color: #008000;">"/lib64/ld-linux-x86-64.so.2"</span>
                        <span style="color: #6276BA;">(</span>file-append glibc <span style="color: #008000;">"/lib/ld-linux-x86-64.so.2"</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span>

    <span style="color: #907373;">(</span>set-xorg-configuration
     <span style="color: #6276BA;">(</span>xorg-configuration
      <span style="color: #858580;">(</span>keyboard-layout keyboard-layout<span style="color: #858580;">)</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span>

    <span style="color: #907373;">(</span>service virtlog-service-type
             <span style="color: #6276BA;">(</span>virtlog-configuration
              <span style="color: #858580;">(</span>max-clients 1000<span style="color: #858580;">)</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span>

    <span style="color: #907373;">(</span>service libvirt-service-type
             <span style="color: #6276BA;">(</span>libvirt-configuration
              <span style="color: #858580;">(</span>unix-sock-group <span style="color: #008000;">"libvirt"</span><span style="color: #858580;">)</span>
              <span style="color: #858580;">(</span>tls-port <span style="color: #008000;">"16555"</span><span style="color: #858580;">)</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span>

    <span style="color: #907373;">(</span>service docker-service-type<span style="color: #907373;">)</span>

    <span style="color: #907373;">(</span>service zram-device-service-type
             <span style="color: #6276BA;">(</span>zram-device-configuration
              <span style="color: #858580;">(</span>size <span style="color: #008000;">"8172M"</span><span style="color: #858580;">)</span>
              <span style="color: #858580;">(</span>compression-algorithm 'zstd<span style="color: #858580;">)</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
   %my-services<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>

 <span style="color: #7388D6;">(</span>bootloader
  <span style="color: #909183;">(</span>bootloader-configuration
   <span style="color: #709870;">(</span>bootloader grub-efi-bootloader<span style="color: #709870;">)</span>
   <span style="color: #709870;">(</span>targets '<span style="color: #907373;">(</span><span style="color: #008000;">"/boot/efi"</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
   <span style="color: #709870;">(</span>timeout 3<span style="color: #709870;">)</span>
   <span style="color: #709870;">(</span>keyboard-layout keyboard-layout<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>
 <span style="color: #7388D6;">(</span>file-systems
  <span style="color: #909183;">(</span>cons*   
   <span style="color: #709870;">(</span>file-system
    <span style="color: #907373;">(</span>mount-point <span style="color: #008000;">"/"</span><span style="color: #907373;">)</span>
    <span style="color: #907373;">(</span>device
     <span style="color: #6276BA;">(</span>uuid <span style="color: #008000;">""</span>
           'btrfs<span style="color: #6276BA;">)</span><span style="color: #907373;">)</span>
    <span style="color: #907373;">(</span>type <span style="color: #008000;">"btrfs"</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
   <span style="color: #709870;">(</span>file-system
    <span style="color: #907373;">(</span>mount-point <span style="color: #008000;">"/boot/efi"</span><span style="color: #907373;">)</span>
    <span style="color: #907373;">(</span>device
     <span style="color: #6276BA;">(</span>uuid <span style="color: #008000;">""</span>
           'fat32<span style="color: #6276BA;">)</span><span style="color: #907373;">)</span>
    <span style="color: #907373;">(</span>type <span style="color: #008000;">"vfat"</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
   <span style="color: #709870;">(</span>file-system <span style="color: #8D8D84; font-style: italic;">;; </span><span style="color: #8D8D84; font-style: italic;">Second hard drive</span>
    <span style="color: #907373;">(</span>mount-point <span style="color: #008000;">"/mnt/media/nil/external"</span><span style="color: #907373;">)</span>
    <span style="color: #907373;">(</span>device
     <span style="color: #6276BA;">(</span>uuid <span style="color: #008000;">""</span>
           'ext4<span style="color: #6276BA;">)</span><span style="color: #907373;">)</span>
    <span style="color: #907373;">(</span>type <span style="color: #008000;">"ext4"</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
   %base-file-systems<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
I start up a Geiser REPL and begin by importing all my modules, basically just copy-pasting from the header of this file. I had to remove a few modules that I didn't have definitions locally available for.
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #0000FF;">use-modules</span> <span style="color: #7388D6;">(</span>gnu<span style="color: #7388D6;">)</span>
             <span style="color: #7388D6;">(</span>gnu services<span style="color: #7388D6;">)</span>
             <span style="color: #7388D6;">(</span>gnu services dbus<span style="color: #7388D6;">)</span>
             <span style="color: #7388D6;">(</span>gnu packages gnome<span style="color: #7388D6;">)</span>
             <span style="color: #7388D6;">(</span>gnu services virtualization<span style="color: #7388D6;">)</span>
             <span style="color: #7388D6;">(</span>gnu services shepherd<span style="color: #7388D6;">)</span>
             <span style="color: #7388D6;">(</span>gnu services admin<span style="color: #7388D6;">)</span>
             <span style="color: #7388D6;">(</span>guix channels<span style="color: #7388D6;">)</span>
             <span style="color: #7388D6;">(</span>gnu services mcron<span style="color: #7388D6;">)</span>
             <span style="color: #7388D6;">(</span>gnu services docker<span style="color: #7388D6;">)</span>
             <span style="color: #7388D6;">(</span>gnu packages fonts<span style="color: #7388D6;">)</span>
             <span style="color: #7388D6;">(</span>gnu packages networking<span style="color: #7388D6;">)</span>
             <span style="color: #7388D6;">(</span>guix gexp<span style="color: #7388D6;">)</span>
             <span style="color: #7388D6;">(</span>guix packages<span style="color: #7388D6;">)</span>
             <span style="color: #7388D6;">(</span>srfi srfi-1<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>use-service-modules linux desktop networking ssh xorg<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>use-package-modules linux package-management<span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
