org/2023-06-13-Guix_Dive.org
* The hacking begins - the operating system record

I think the best place to begin is the actual ~operating-system~ declaration. Using ~xref-find-definitions~ (bound to ~M-.~ by default)  I can jump straight to where it's defined. Here's what the definition looks like (be warned, another lengthy definition below!):

#+begin_src scheme
  (define-record-type* <operating-system> operating-system
    make-operating-system
    operating-system?
    this-operating-system

    (kernel operating-system-kernel                 ; package
	    (default linux-libre))
    (kernel-loadable-modules operating-system-kernel-loadable-modules
			     (default '()))                ; list of packages
    (kernel-arguments operating-system-user-kernel-arguments
		      (default %default-kernel-arguments)) ; list of gexps/strings
    (hurd operating-system-hurd
	  (default #f))                             ; package
    (bootloader operating-system-bootloader)        ; <bootloader-configuration>
    (label operating-system-label                   ; string
	   (thunked)
	   (default (operating-system-default-label this-operating-system)))

    (keyboard-layout operating-system-keyboard-layout ;#f | <keyboard-layout>
		     (default #f))
    (initrd operating-system-initrd                 ; (list fs) -> file-like
	    (default base-initrd))
    (initrd-modules operating-system-initrd-modules ; list of strings
		    (thunked)                       ; it's system-dependent
		    (default %base-initrd-modules))

    (firmware operating-system-firmware             ; list of packages
	      (default %base-firmware))

    (host-name operating-system-host-name)          ; string
    (hosts-file %operating-system-hosts-file         ; deprecated
		(default #f)
		(sanitize warn-hosts-file-field-deprecation))

    (mapped-devices operating-system-mapped-devices ; list of <mapped-device>
		    (default '()))
    (file-systems operating-system-file-systems)    ; list of fs
    (swap-devices operating-system-swap-devices     ; list of string | <swap-space>
		  (default '())
		  (delayed)
		  (sanitize warn-swap-devices-change))

    (users operating-system-users                   ; list of user accounts
	   (default %base-user-accounts))
    (groups operating-system-groups                 ; list of user groups
	    (default %base-groups))

    (skeletons operating-system-skeletons           ; list of name/file-like value
	       (default (default-skeletons)))
    (issue operating-system-issue                   ; string
	   (default %default-issue))

    (packages operating-system-packages             ; list of (PACKAGE OUTPUT...)
	      (default %base-packages))             ; or just PACKAGE

    (timezone operating-system-timezone
	      (default "Etc/UTC"))                  ; string
    (locale   operating-system-locale               ; string
	      (default "en_US.utf8"))
    (locale-definitions operating-system-locale-definitions ; list of <locale-definition>
			(default %default-locale-definitions))
    (locale-libcs operating-system-locale-libcs     ; list of <packages>
		  (default %default-locale-libcs))
    (name-service-switch operating-system-name-service-switch ; <name-service-switch>
			 (default %default-nss))

    (essential-services operating-system-essential-services ; list of services
			(thunked)
			(default (operating-system-default-essential-services
				  this-operating-system)))
    (services operating-system-user-services        ; list of services
	      (thunked)                     ;allow for system-dependent services
	      (default %base-services))

    (pam-services operating-system-pam-services     ; list of PAM services
		  (default (base-pam-services)))
    (setuid-programs operating-system-setuid-programs
		     (default %setuid-programs)     ; list of <setuid-program>
		     (sanitize ensure-setuid-program-list))

    (sudoers-file operating-system-sudoers-file     ; file-like
		  (default %sudoers-specification))

    (location operating-system-location             ; <location>
	      (default (and=> (current-source-location)
			      source-properties->location))
	      (innate)))
#+end_src
I can immediately spot some familiar pieces here.

So ~operating-system~ is actually a *Scheme record*. These are used very often in the Guix source code, and we'll see them a lot.
A record is a fairly straightforward kind of object, one consisting of 2 parts - the keys and their values. Each key has a single value assigned to it.

One of the very first keys here looks like this:
#+begin_src scheme
      (kernel-arguments operating-system-user-kernel-arguments
			(default %default-kernel-arguments)) ; list of gexps/strings
#+end_src

Even without great understanding of the record syntax it's clear what's going on here. We define a key, something that appears to be its accessor and lastly a ~(default)~ section.
The comments here are helpful too, telling us what the supplied type is supposed to be.

We can see ~%default-kernel-arguments~ is being used here. We can check its value by evaluating it within the REPL.
#+begin_src scheme
  scheme@(guile-user)> %default-kernel-arguments
  $5 = ("modprobe.blacklist=usbmouse,usbkbd" "quiet")
#+end_src
So the ~%default-kernel-arguments~ is just a list of strings.

From this we can see that adding a custom kernel argument in the ~config.scm~ would be as simple as adding a string to this list like so: 
#+begin_src scheme
  (operating-system
    ...

    (kernel-arguments (cons "nomodeset" %default-kernel-arguments))
    
    ...
    )
#+end_src

I've already learned something cool about how Guix handles kernel arguments and the system declaration!

