_posts/2023-06-13-Guix_Dive.html

<div id="outline-container-orgb6e9c6c" class="outline-2">
<h2 id="orgb6e9c6c">The hacking begins - the operating system record</h2>
<div class="outline-text-2" id="text-orgb6e9c6c">
<p>
I think the best place to begin is the actual <code>operating-system</code> declaration. Using <code>xref-find-definitions</code> (bound to <code>M-.</code> by default)  I can jump straight to where it's defined. Here's what the definition looks like (be warned, another lengthy definition below!):
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #707183;">(</span>define-record-type* <span style="color: #6434A3;">&lt;operating-system&gt;</span> operating-system
  make-operating-system
  operating-system?
  this-operating-system

  <span style="color: #7388D6;">(</span>kernel operating-system-kernel                 <span style="color: #8D8D84; font-style: italic;">; </span><span style="color: #8D8D84; font-style: italic;">package</span>
          <span style="color: #909183;">(</span>default linux-libre<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span>kernel-loadable-modules operating-system-kernel-loadable-modules
                           <span style="color: #909183;">(</span>default '<span style="color: #709870;">()</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>                <span style="color: #8D8D84; font-style: italic;">; </span><span style="color: #8D8D84; font-style: italic;">list of packages</span>
  <span style="color: #7388D6;">(</span>kernel-arguments operating-system-user-kernel-arguments
                    <span style="color: #909183;">(</span>default %default-kernel-arguments<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span> <span style="color: #8D8D84; font-style: italic;">; </span><span style="color: #8D8D84; font-style: italic;">list of gexps/strings</span>
  <span style="color: #7388D6;">(</span>hurd operating-system-hurd
        <span style="color: #909183;">(</span>default #f<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>                             <span style="color: #8D8D84; font-style: italic;">; </span><span style="color: #8D8D84; font-style: italic;">package</span>
  <span style="color: #7388D6;">(</span>bootloader operating-system-bootloader<span style="color: #7388D6;">)</span>        <span style="color: #8D8D84; font-style: italic;">; </span><span style="color: #8D8D84; font-style: italic;">&lt;bootloader-configuration&gt;</span>
  <span style="color: #7388D6;">(</span>label operating-system-label                   <span style="color: #8D8D84; font-style: italic;">; </span><span style="color: #8D8D84; font-style: italic;">string</span>
         <span style="color: #909183;">(</span>thunked<span style="color: #909183;">)</span>
         <span style="color: #909183;">(</span>default <span style="color: #709870;">(</span>operating-system-default-label this-operating-system<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>

  <span style="color: #7388D6;">(</span>keyboard-layout operating-system-keyboard-layout <span style="color: #8D8D84; font-style: italic;">;</span><span style="color: #8D8D84; font-style: italic;">#f | &lt;keyboard-layout&gt;</span>
                   <span style="color: #909183;">(</span>default #f<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span>initrd operating-system-initrd                 <span style="color: #8D8D84; font-style: italic;">; </span><span style="color: #8D8D84; font-style: italic;">(list fs) -&gt; file-like</span>
          <span style="color: #909183;">(</span>default base-initrd<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span>initrd-modules operating-system-initrd-modules <span style="color: #8D8D84; font-style: italic;">; </span><span style="color: #8D8D84; font-style: italic;">list of strings</span>
                  <span style="color: #909183;">(</span>thunked<span style="color: #909183;">)</span>                       <span style="color: #8D8D84; font-style: italic;">; </span><span style="color: #8D8D84; font-style: italic;">it's system-dependent</span>
                  <span style="color: #909183;">(</span>default %base-initrd-modules<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>

  <span style="color: #7388D6;">(</span>firmware operating-system-firmware             <span style="color: #8D8D84; font-style: italic;">; </span><span style="color: #8D8D84; font-style: italic;">list of packages</span>
            <span style="color: #909183;">(</span>default %base-firmware<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>

  <span style="color: #7388D6;">(</span>host-name operating-system-host-name<span style="color: #7388D6;">)</span>          <span style="color: #8D8D84; font-style: italic;">; </span><span style="color: #8D8D84; font-style: italic;">string</span>
  <span style="color: #7388D6;">(</span>hosts-file %operating-system-hosts-file         <span style="color: #8D8D84; font-style: italic;">; </span><span style="color: #8D8D84; font-style: italic;">deprecated</span>
              <span style="color: #909183;">(</span>default #f<span style="color: #909183;">)</span>
              <span style="color: #909183;">(</span>sanitize warn-hosts-file-field-deprecation<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>

  <span style="color: #7388D6;">(</span>mapped-devices operating-system-mapped-devices <span style="color: #8D8D84; font-style: italic;">; </span><span style="color: #8D8D84; font-style: italic;">list of &lt;mapped-device&gt;</span>
                  <span style="color: #909183;">(</span>default '<span style="color: #709870;">()</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span>file-systems operating-system-file-systems<span style="color: #7388D6;">)</span>    <span style="color: #8D8D84; font-style: italic;">; </span><span style="color: #8D8D84; font-style: italic;">list of fs</span>
  <span style="color: #7388D6;">(</span>swap-devices operating-system-swap-devices     <span style="color: #8D8D84; font-style: italic;">; </span><span style="color: #8D8D84; font-style: italic;">list of string | &lt;swap-space&gt;</span>
                <span style="color: #909183;">(</span>default '<span style="color: #709870;">()</span><span style="color: #909183;">)</span>
                <span style="color: #909183;">(</span>delayed<span style="color: #909183;">)</span>
                <span style="color: #909183;">(</span>sanitize warn-swap-devices-change<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>

  <span style="color: #7388D6;">(</span>users operating-system-users                   <span style="color: #8D8D84; font-style: italic;">; </span><span style="color: #8D8D84; font-style: italic;">list of user accounts</span>
         <span style="color: #909183;">(</span>default %base-user-accounts<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span>groups operating-system-groups                 <span style="color: #8D8D84; font-style: italic;">; </span><span style="color: #8D8D84; font-style: italic;">list of user groups</span>
          <span style="color: #909183;">(</span>default %base-groups<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>

  <span style="color: #7388D6;">(</span>skeletons operating-system-skeletons           <span style="color: #8D8D84; font-style: italic;">; </span><span style="color: #8D8D84; font-style: italic;">list of name/file-like value</span>
             <span style="color: #909183;">(</span>default <span style="color: #709870;">(</span>default-skeletons<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span>issue operating-system-issue                   <span style="color: #8D8D84; font-style: italic;">; </span><span style="color: #8D8D84; font-style: italic;">string</span>
         <span style="color: #909183;">(</span>default %default-issue<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>

  <span style="color: #7388D6;">(</span>packages operating-system-packages             <span style="color: #8D8D84; font-style: italic;">; </span><span style="color: #8D8D84; font-style: italic;">list of (PACKAGE OUTPUT...)</span>
            <span style="color: #909183;">(</span>default %base-packages<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>             <span style="color: #8D8D84; font-style: italic;">; </span><span style="color: #8D8D84; font-style: italic;">or just PACKAGE</span>

  <span style="color: #7388D6;">(</span>timezone operating-system-timezone
            <span style="color: #909183;">(</span>default <span style="color: #008000;">"Etc/UTC"</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>                  <span style="color: #8D8D84; font-style: italic;">; </span><span style="color: #8D8D84; font-style: italic;">string</span>
  <span style="color: #7388D6;">(</span>locale   operating-system-locale               <span style="color: #8D8D84; font-style: italic;">; </span><span style="color: #8D8D84; font-style: italic;">string</span>
            <span style="color: #909183;">(</span>default <span style="color: #008000;">"en_US.utf8"</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span>locale-definitions operating-system-locale-definitions <span style="color: #8D8D84; font-style: italic;">; </span><span style="color: #8D8D84; font-style: italic;">list of &lt;locale-definition&gt;</span>
                      <span style="color: #909183;">(</span>default %default-locale-definitions<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span>locale-libcs operating-system-locale-libcs     <span style="color: #8D8D84; font-style: italic;">; </span><span style="color: #8D8D84; font-style: italic;">list of &lt;packages&gt;</span>
                <span style="color: #909183;">(</span>default %default-locale-libcs<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span>name-service-switch operating-system-name-service-switch <span style="color: #8D8D84; font-style: italic;">; </span><span style="color: #8D8D84; font-style: italic;">&lt;name-service-switch&gt;</span>
                       <span style="color: #909183;">(</span>default %default-nss<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>

  <span style="color: #7388D6;">(</span>essential-services operating-system-essential-services <span style="color: #8D8D84; font-style: italic;">; </span><span style="color: #8D8D84; font-style: italic;">list of services</span>
                      <span style="color: #909183;">(</span>thunked<span style="color: #909183;">)</span>
                      <span style="color: #909183;">(</span>default <span style="color: #709870;">(</span>operating-system-default-essential-services
                                this-operating-system<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span>services operating-system-user-services        <span style="color: #8D8D84; font-style: italic;">; </span><span style="color: #8D8D84; font-style: italic;">list of services</span>
            <span style="color: #909183;">(</span>thunked<span style="color: #909183;">)</span>                     <span style="color: #8D8D84; font-style: italic;">;</span><span style="color: #8D8D84; font-style: italic;">allow for system-dependent services</span>
            <span style="color: #909183;">(</span>default %base-services<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>

  <span style="color: #7388D6;">(</span>pam-services operating-system-pam-services     <span style="color: #8D8D84; font-style: italic;">; </span><span style="color: #8D8D84; font-style: italic;">list of PAM services</span>
                <span style="color: #909183;">(</span>default <span style="color: #709870;">(</span>base-pam-services<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span>setuid-programs operating-system-setuid-programs
                   <span style="color: #909183;">(</span>default %setuid-programs<span style="color: #909183;">)</span>     <span style="color: #8D8D84; font-style: italic;">; </span><span style="color: #8D8D84; font-style: italic;">list of &lt;setuid-program&gt;</span>
                   <span style="color: #909183;">(</span>sanitize ensure-setuid-program-list<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>

  <span style="color: #7388D6;">(</span>sudoers-file operating-system-sudoers-file     <span style="color: #8D8D84; font-style: italic;">; </span><span style="color: #8D8D84; font-style: italic;">file-like</span>
                <span style="color: #909183;">(</span>default %sudoers-specification<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>

  <span style="color: #7388D6;">(</span>location operating-system-location             <span style="color: #8D8D84; font-style: italic;">; </span><span style="color: #8D8D84; font-style: italic;">&lt;location&gt;</span>
            <span style="color: #909183;">(</span>default <span style="color: #709870;">(</span>and=&gt; <span style="color: #907373;">(</span>current-source-location<span style="color: #907373;">)</span>
                            source-properties-&gt;location<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
            <span style="color: #909183;">(</span>innate<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
<p>
I can immediately spot some familiar pieces here.
</p>

<p>
So <code>operating-system</code> is actually a <b>Scheme record</b>. These are used very often in the Guix source code, and we'll see them a lot.
A record is a fairly straightforward kind of object, one consisting of 2 parts - the keys and their values. Each key has a single value assigned to it.
</p>

<p>
One of the very first keys here looks like this:
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #707183;">(</span>kernel-arguments operating-system-user-kernel-arguments
                  <span style="color: #7388D6;">(</span>default %default-kernel-arguments<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span> <span style="color: #8D8D84; font-style: italic;">; </span><span style="color: #8D8D84; font-style: italic;">list of gexps/strings</span>
</pre>
</div>

<p>
Even without great understanding of the record syntax it's clear what's going on here. We define a key, something that appears to be its accessor and lastly a <code>(default)</code> section.
The comments here are helpful too, telling us what the supplied type is supposed to be.
</p>

<p>
We can see <code>%default-kernel-arguments</code> is being used here. We can check its value by evaluating it within the REPL.
</p>
<div class="org-src-container">
<pre class="src src-scheme">scheme@<span style="color: #707183;">(</span>guile-user<span style="color: #707183;">)</span>&gt; %default-kernel-arguments
$5 = <span style="color: #707183;">(</span><span style="color: #008000;">"modprobe.blacklist=usbmouse,usbkbd"</span> <span style="color: #008000;">"quiet"</span><span style="color: #707183;">)</span>
</pre>
</div>
<p>
So the <code>%default-kernel-arguments</code> is just a list of strings.
</p>

<p>
From this we can see that adding a custom kernel argument in the <code>config.scm</code> would be as simple as adding a string to this list like so: 
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #707183;">(</span>operating-system
  ...

  <span style="color: #7388D6;">(</span>kernel-arguments <span style="color: #909183;">(</span>cons <span style="color: #008000;">"nomodeset"</span> %default-kernel-arguments<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>

  ...
  <span style="color: #707183;">)</span>
</pre>
</div>

<p>
I've already learned something cool about how Guix handles kernel arguments and the system declaration!
</p>
</div>
</div>
