org/2023-06-13-Guix_Dive.org
* Hacking continued - a look into the package values
With this basic knowledge I can look at some of the more interesting default values that are part of my configuration.

Let's start by peeking into the default package list, stored as ~%base-packages~.
#+begin_src scheme
  scheme@(guile-user)> %base-packages
  $6 = (#<package guix-icons@0.1 gnu/packages/package-management.scm:629 7f1836ad24d0> #<package less@608 gnu/packages/less.scm:38 7f183a855210> #<package mg@20221112 gnu/packages/text-editors.scm:502 7f1836bad370> #<package nano@7.2 gnu/packages/nano.scm:32 7f18313429a0> #<package nvi@1.81.6 gnu/packages/nvi.scm:32 7f183042bd10> #<package man-db@2.11.1 gnu/packages/man.scm:128 7f182f1f2d10> #<package info-reader@6.8 gnu/packages/texinfo.scm:195 7f182f720bb0> #<package bash-completion@2.11 gnu/packages/bash.scm:301 7f182f513370> #<package kbd@2.5.1 gnu/packages/linux.scm:3908 7f18311676e0> #<package sudo@1.9.13p2 gnu/packages/admin.scm:1958 7f182fc84d10> #<package guile-readline@3.0.9 gnu/packages/guile.scm:483 7f182f01c0b0> #<package guile-colorized@0.1 gnu/packages/guile-xyz.scm:1130 7f182f55fc60> #<package pciutils@3.8.0 gnu/packages/pciutils.scm:82 7f1836d19210> #<package usbutils@015 gnu/packages/linux.scm:2372 7f183114d420> #<package util-linux-with-udev@2.37.4 gnu/packages/linux.scm:2218 7f183114d790> #<package kmod@29 gnu/packages/linux.scm:4035 7f18311674d0> #<package eudev@3.2.11 gnu/packages/linux.scm:4145 7f1831167370> #<package inetutils@2.3 gnu/packages/admin.scm:893 7f182fc83b00> #<package isc-dhcp@4.4.3-P1 gnu/packages/admin.scm:1399 7f182fc83420> #<package iproute2@6.0.0 gnu/packages/linux.scm:3087 7f1831166630> #<package wget@1.21.3.24 gnu/packages/wget.scm:47 7f182f321f20> #<package iw@5.19 gnu/packages/linux.scm:3389 7f1831166160> #<package wireless-tools@30.pre9 gnu/packages/linux.scm:4507 7f1831181dc0> #<package procps@4.0.3 gnu/packages/linux.scm:2327 7f183114d4d0> #<package psmisc@23.5 gnu/packages/linux.scm:2044 7f183114d8f0> #<package which@2.21 gnu/packages/base.scm:1399 7f1830412000> #<package shadow@4.13 gnu/packages/admin.scm:950 7f182fc83a50> #<package e2fsprogs@1.46.4 gnu/packages/linux.scm:2446 7f183114d2c0> #<package guile@3.0.9 gnu/packages/guile.scm:317 7f182f01c2c0> #<package bash@5.1.16 gnu/packages/bash.scm:133 7f182f5136e0> #<package coreutils@9.1 gnu/packages/base.scm:365 7f182f1fd9a0> #<package findutils@4.9.0 gnu/packages/base.scm:327 7f182f1fda50> #<package grep@3.8 gnu/packages/base.scm:108 7f182f1fddc0> #<package sed@4.8 gnu/packages/base.scm:163 7f182f1fdd10> #<package diffutils@3.8 gnu/packages/base.scm:299 7f182f1fdb00> #<package patch@2.7.6 gnu/packages/base.scm:269 7f182f1fdbb0> #<package gawk@5.2.1 gnu/packages/gawk.scm:40 7f182f16b370> #<package tar@1.34 gnu/packages/base.scm:204 7f182f1fdc60> #<package gzip@1.12 gnu/packages/compression.scm:251 7f182f416630> #<package bzip2@1.0.8 gnu/packages/compression.scm:288 7f182f416580> #<package xz@5.2.8 gnu/packages/compression.scm:494 7f182f416370> #<package lzip@1.23 gnu/packages/compression.scm:625 7f182f4160b0>)
#+end_src

This output isn't particularly easy to parse, but it does tell us a few things. Probably the most important part is that packages are actually records too! This means we can also use a simple accessor to access different keys and their values.

I'm not entirely sure what the keys and their accessors are at this point, but I'll guess there's a ~package-name~ function. With this I can get a better look at the default package list.
#+begin_src scheme
  scheme@(guile-user)> (map package-name %base-packages)
  $7 = ("guix-icons" "less" "mg" "nano" "nvi" "man-db" "info-reader" "bash-completion" "kbd" "sudo" "guile-readline" "guile-colorized" "pciutils" "usbutils" "util-linux-with-udev" "kmod" "eudev" "inetutils" "isc-dhcp" "iproute2" "wget" "iw" "wireless-tools" "procps" "psmisc" "which" "shadow" "e2fsprogs" "guile" "bash" "coreutils" "findutils" "grep" "sed" "diffutils" "patch" "gawk" "tar" "gzip" "bzip2" "xz" "lzip")
#+end_src
Great, this is much more readable!

Seeing as ~%base-packages~ is actually just a list, I can also see how easy it is to manipulate it - let's remove ~nano~ from the default packages using a simple lambda filter.
#+begin_src scheme
  (remove (lambda (pkg) (string= (package-name pkg) "nano")) %base-packages)
#+end_src
This returns a brand new package list with ~nano~ missing this time. Pretty cool, I could definitely use this to strip out some unnecessary packages out of my system ;).

Basic list manipulation is actually very powerful within Guix. It's also going to allow me to modify the service list, among many other things - but more on that later.

