_posts/2023-06-13-Guix_Dive.html

<div id="outline-container-orgf4f279c" class="outline-2">
<h2 id="orgf4f279c">Hacking continued - a look into the package values</h2>
<div class="outline-text-2" id="text-orgf4f279c">
<p>
With this basic knowledge I can look at some of the more interesting default values that are part of my configuration.
</p>

<p>
Let's start by peeking into the default package list, stored as <code>%base-packages</code>.
</p>
<div class="org-src-container">
<pre class="src src-scheme">scheme@<span style="color: #707183;">(</span>guile-user<span style="color: #707183;">)</span>&gt; %base-packages
$6 = <span style="color: #707183;">(</span>#&lt;package guix-icons@0.1 gnu/packages/package-management.scm:629 7f1836ad24d0&gt; #&lt;package less@608 gnu/packages/less.scm:38 7f183a855210&gt; #&lt;package mg@20221112 gnu/packages/text-editors.scm:502 7f1836bad370&gt; #&lt;package nano@7.2 gnu/packages/nano.scm:32 7f18313429a0&gt; #&lt;package nvi@1.81.6 gnu/packages/nvi.scm:32 7f183042bd10&gt; #&lt;package man-db@2.11.1 gnu/packages/man.scm:128 7f182f1f2d10&gt; #&lt;package info-reader@6.8 gnu/packages/texinfo.scm:195 7f182f720bb0&gt; #&lt;package bash-completion@2.11 gnu/packages/bash.scm:301 7f182f513370&gt; #&lt;package kbd@2.5.1 gnu/packages/linux.scm:3908 7f18311676e0&gt; #&lt;package sudo@1.9.13p2 gnu/packages/admin.scm:1958 7f182fc84d10&gt; #&lt;package guile-readline@3.0.9 gnu/packages/guile.scm:483 7f182f01c0b0&gt; #&lt;package guile-colorized@0.1 gnu/packages/guile-xyz.scm:1130 7f182f55fc60&gt; #&lt;package pciutils@3.8.0 gnu/packages/pciutils.scm:82 7f1836d19210&gt; #&lt;package usbutils@015 gnu/packages/linux.scm:2372 7f183114d420&gt; #&lt;package util-linux-with-udev@2.37.4 gnu/packages/linux.scm:2218 7f183114d790&gt; #&lt;package kmod@29 gnu/packages/linux.scm:4035 7f18311674d0&gt; #&lt;package eudev@3.2.11 gnu/packages/linux.scm:4145 7f1831167370&gt; #&lt;package inetutils@2.3 gnu/packages/admin.scm:893 7f182fc83b00&gt; #&lt;package isc-dhcp@4.4.3-P1 gnu/packages/admin.scm:1399 7f182fc83420&gt; #&lt;package iproute2@6.0.0 gnu/packages/linux.scm:3087 7f1831166630&gt; #&lt;package wget@1.21.3.24 gnu/packages/wget.scm:47 7f182f321f20&gt; #&lt;package iw@5.19 gnu/packages/linux.scm:3389 7f1831166160&gt; #&lt;package wireless-tools@30.pre9 gnu/packages/linux.scm:4507 7f1831181dc0&gt; #&lt;package procps@4.0.3 gnu/packages/linux.scm:2327 7f183114d4d0&gt; #&lt;package psmisc@23.5 gnu/packages/linux.scm:2044 7f183114d8f0&gt; #&lt;package which@2.21 gnu/packages/base.scm:1399 7f1830412000&gt; #&lt;package shadow@4.13 gnu/packages/admin.scm:950 7f182fc83a50&gt; #&lt;package e2fsprogs@1.46.4 gnu/packages/linux.scm:2446 7f183114d2c0&gt; #&lt;package guile@3.0.9 gnu/packages/guile.scm:317 7f182f01c2c0&gt; #&lt;package bash@5.1.16 gnu/packages/bash.scm:133 7f182f5136e0&gt; #&lt;package coreutils@9.1 gnu/packages/base.scm:365 7f182f1fd9a0&gt; #&lt;package findutils@4.9.0 gnu/packages/base.scm:327 7f182f1fda50&gt; #&lt;package grep@3.8 gnu/packages/base.scm:108 7f182f1fddc0&gt; #&lt;package sed@4.8 gnu/packages/base.scm:163 7f182f1fdd10&gt; #&lt;package diffutils@3.8 gnu/packages/base.scm:299 7f182f1fdb00&gt; #&lt;package patch@2.7.6 gnu/packages/base.scm:269 7f182f1fdbb0&gt; #&lt;package gawk@5.2.1 gnu/packages/gawk.scm:40 7f182f16b370&gt; #&lt;package tar@1.34 gnu/packages/base.scm:204 7f182f1fdc60&gt; #&lt;package gzip@1.12 gnu/packages/compression.scm:251 7f182f416630&gt; #&lt;package bzip2@1.0.8 gnu/packages/compression.scm:288 7f182f416580&gt; #&lt;package xz@5.2.8 gnu/packages/compression.scm:494 7f182f416370&gt; #&lt;package lzip@1.23 gnu/packages/compression.scm:625 7f182f4160b0&gt;<span style="color: #707183;">)</span>
</pre>
</div>

<p>
This output isn't particularly easy to parse, but it does tell us a few things. Probably the most important part is that packages are actually records too! This means we can also use a simple accessor to access different keys and their values.
</p>

<p>
I'm not entirely sure what the keys and their accessors are at this point, but I'll guess there's a <code>package-name</code> function. With this I can get a better look at the default package list.
</p>
<div class="org-src-container">
<pre class="src src-scheme">scheme@<span style="color: #707183;">(</span>guile-user<span style="color: #707183;">)</span>&gt; <span style="color: #707183;">(</span><span style="color: #0000FF;">map</span> package-name %base-packages<span style="color: #707183;">)</span>
$7 = <span style="color: #707183;">(</span><span style="color: #008000;">"guix-icons"</span> <span style="color: #008000;">"less"</span> <span style="color: #008000;">"mg"</span> <span style="color: #008000;">"nano"</span> <span style="color: #008000;">"nvi"</span> <span style="color: #008000;">"man-db"</span> <span style="color: #008000;">"info-reader"</span> <span style="color: #008000;">"bash-completion"</span> <span style="color: #008000;">"kbd"</span> <span style="color: #008000;">"sudo"</span> <span style="color: #008000;">"guile-readline"</span> <span style="color: #008000;">"guile-colorized"</span> <span style="color: #008000;">"pciutils"</span> <span style="color: #008000;">"usbutils"</span> <span style="color: #008000;">"util-linux-with-udev"</span> <span style="color: #008000;">"kmod"</span> <span style="color: #008000;">"eudev"</span> <span style="color: #008000;">"inetutils"</span> <span style="color: #008000;">"isc-dhcp"</span> <span style="color: #008000;">"iproute2"</span> <span style="color: #008000;">"wget"</span> <span style="color: #008000;">"iw"</span> <span style="color: #008000;">"wireless-tools"</span> <span style="color: #008000;">"procps"</span> <span style="color: #008000;">"psmisc"</span> <span style="color: #008000;">"which"</span> <span style="color: #008000;">"shadow"</span> <span style="color: #008000;">"e2fsprogs"</span> <span style="color: #008000;">"guile"</span> <span style="color: #008000;">"bash"</span> <span style="color: #008000;">"coreutils"</span> <span style="color: #008000;">"findutils"</span> <span style="color: #008000;">"grep"</span> <span style="color: #008000;">"sed"</span> <span style="color: #008000;">"diffutils"</span> <span style="color: #008000;">"patch"</span> <span style="color: #008000;">"gawk"</span> <span style="color: #008000;">"tar"</span> <span style="color: #008000;">"gzip"</span> <span style="color: #008000;">"bzip2"</span> <span style="color: #008000;">"xz"</span> <span style="color: #008000;">"lzip"</span><span style="color: #707183;">)</span>
</pre>
</div>
<p>
Great, this is much more readable!
</p>

<p>
Seeing as <code>%base-packages</code> is actually just a list, I can also see how easy it is to manipulate it - let's remove <code>nano</code> from the default packages using a simple lambda filter.
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #707183;">(</span>remove <span style="color: #7388D6;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #909183;">(</span>pkg<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>string= <span style="color: #709870;">(</span>package-name pkg<span style="color: #709870;">)</span> <span style="color: #008000;">"nano"</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span> %base-packages<span style="color: #707183;">)</span>
</pre>
</div>
<p>
This returns a brand new package list with <code>nano</code> missing this time. Pretty cool, I could definitely use this to strip out some unnecessary packages out of my system ;).
</p>

<p>
Basic list manipulation is actually very powerful within Guix. It's also going to allow me to modify the service list, among many other things - but more on that later.
</p>
</div>
</div>
