org/2023-06-13-Guix_Dive.org
* Package specification
Looking into the ~packages~ section of my system configuration I notice the use of a specification function.

#+begin_src scheme
  (packages
   (append
    (map specification->package
	 (list
	  "nss-certs"
	  "xf86-video-amdgpu"
	  "amdgpu-firmware"
	  "bluez"
	  "blueman"
	  "vim"
	  "sway"
	  "wofi"
	  "libratbag"
	  "git"))
    %base-packages))
#+end_src

In essence it looks like ~(specification->package)~ takes a package name string and returns the first matching package definition it finds. I can verify this by looking at the definition of this function.
#+begin_src scheme
  (define (specification->package spec)
    "Return a package matching SPEC.  SPEC may be a package name, or a package
  name followed by an at-sign and a version number.  If the version number is not
  present, return the preferred newest version."
    (let ((name version (package-name->name+version spec)))
      (%find-package spec name version)))
#+end_src
I won't bother digging in deeper into the ~%find-package~ function now.

