_posts/2023-06-13-Guix_Dive.html

<div id="outline-container-orgdce4635" class="outline-2">
<h2 id="orgdce4635">Package specification</h2>
<div class="outline-text-2" id="text-orgdce4635">
<p>
Looking into the <code>packages</code> section of my system configuration I notice the use of a specification function.
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #707183;">(</span>packages
 <span style="color: #7388D6;">(</span>append
  <span style="color: #909183;">(</span><span style="color: #0000FF;">map</span> specification-&gt;package
       <span style="color: #709870;">(</span>list
        <span style="color: #008000;">"nss-certs"</span>
        <span style="color: #008000;">"xf86-video-amdgpu"</span>
        <span style="color: #008000;">"amdgpu-firmware"</span>
        <span style="color: #008000;">"bluez"</span>
        <span style="color: #008000;">"blueman"</span>
        <span style="color: #008000;">"vim"</span>
        <span style="color: #008000;">"sway"</span>
        <span style="color: #008000;">"wofi"</span>
        <span style="color: #008000;">"libratbag"</span>
        <span style="color: #008000;">"git"</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
  %base-packages<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
In essence it looks like <code>(specification-&gt;package)</code> takes a package name string and returns the first matching package definition it finds. I can verify this by looking at the definition of this function.
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #0000FF;">define</span> <span style="color: #7388D6;">(</span><span style="color: #006699;">specification-&gt;package</span> spec<span style="color: #7388D6;">)</span>
  <span style="color: #008000;">"Return a package matching SPEC.  SPEC may be a package name, or a package</span>
<span style="color: #008000;">name followed by an at-sign and a version number.  If the version number is not</span>
<span style="color: #008000;">present, return the preferred newest version."</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>name version <span style="color: #907373;">(</span>package-name-&gt;name+version spec<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>%find-package spec name version<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
<p>
I won't bother digging in deeper into the <code>%find-package</code> function now.
</p>
</div>
</div>
