org/2023-06-13-Guix_Dive.org
* Package record
Let's look into the ~package~ record next. This one already looks very familiar to me, as I'm somewhat well versed in packaging for Guix by now.

#+begin_src scheme
  (define-record-type* <package>
    package make-package
    package?
    this-package
    (name   package-name)                   ; string
    (version package-version)               ; string
    (source package-source)                 ; <origin> instance
    (build-system package-build-system)     ; <build-system> instance
    (arguments package-arguments            ; arguments for the build method
	       (default '()) (thunked))

    (inputs package-inputs                  ; input packages or derivations
	    (default '()) (thunked)
	    (sanitize sanitize-inputs))
    (propagated-inputs package-propagated-inputs    ; same, but propagated
		       (default '()) (thunked)
		       (sanitize sanitize-inputs))
    (native-inputs package-native-inputs    ; native input packages/derivations
		   (default '()) (thunked)
		   (sanitize sanitize-inputs))

    (outputs package-outputs                ; list of strings
	     (default '("out")))

						    ; lists of
						    ; <search-path-specification>,
						    ; for native and cross
						    ; inputs
    (native-search-paths package-native-search-paths (default '()))
    (search-paths package-search-paths (default '()))

    ;; The 'replacement' field is marked as "innate" because it never makes
    ;; sense to inherit a replacement as is.  See the 'package/inherit' macro.
    (replacement package-replacement                ; package | #f
		 (default #f) (thunked) (innate))

    (synopsis package-synopsis
	      (sanitize validate-texinfo))          ; one-line description
    (description package-description
		 (sanitize validate-texinfo))       ; one or two paragraphs
    (license package-license                        ; (list of) <license>
	     (sanitize validate-license))
    (home-page package-home-page)                   ; string
    (supported-systems package-supported-systems    ; list of strings
		       (default %supported-systems))

    (properties package-properties (default '()))   ; alist for anything else

    (location package-location-vector
	      (default (current-location-vector))
	      (innate) (sanitize sanitize-location))
    (definition-location package-definition-location-code
			 (default (current-definition-location))
			 (innate)))
#+end_src
So packages really are just bog standard records!

So yet again we can use this knowledge to do some fancy stuff. Let's check the inputs of the ~curl~ package as an example. 
#+begin_src scheme
  scheme@(guile-user)> ,use(gnu packages curl)

  scheme@(guile-user)> (map car (package-inputs curl))
  $14 = ("gnutls" "libidn" "mit-krb5" "nghttp2" "zlib")
#+end_src
Notice that I first had to import the correct module to get the ~curl~ definition. If you ever need to find which module contains a package, you can easily obtain this information using ~guix show <package>~. 

Here's a fairly small package I wrote, you can see the practical usage of the record very clearly here.
You may be unfamiliar with a lot of these functions, but don't worry about that for now - just notice how the ~package~ record is used, that's the important part.
(also nevermind the ugly hacks, this is a package strictly for personal use...).
#+begin_src scheme
  (define-public brogue-ce
    (package
     (name "brogue-ce")
     (version "1.12")
     (source (origin
	      (method url-fetch)
	      (uri (string-append "https://github.com/tmewett/BrogueCE/archive/refs/tags/v" version
				  ".tar.gz"))
	      (sha256
	       (base32
		"0a6l7j91iq0mv7zrxnlxx6ll5rfwvgfyk5h1gc9m5qzll1n3zvdf"))))
     (build-system gnu-build-system)
     (arguments
      (list 
       #:make-flags #~(list "CC=gcc")
       #:tests? #f
       #:phases
       #~(modify-phases %standard-phases
			(delete 'configure)
			(add-before 'build 'change-datadir-path
				    (lambda _
				      (map
				       (lambda (substitutes)
					 (substitute* "config.mk"
						      (((car substitutes))
						       (cdr substitutes))))
				       `(("^DATADIR := ." . ,(string-append "DATADIR := " #$output "/share"))
					 ("^RELEASE := NO" . "RELEASE := YES")))))
			(replace 'install
				 (lambda _
				   (mkdir-p (string-append #$output "/bin"))
				   (copy-file "bin/brogue" (string-append #$output "/bin/.brogue_real"))
				   (call-with-output-file (string-append #$output "/bin/brogue") ; Wrap around executable and execute in ~/.local
				     (lambda (file)
				       (format file "~A" (string-append
							  "mkdir -p \"$HOME/.local/share/brogue\" && cd \"$HOME/.local/share/brogue\" && "
							  #$output "/bin/.brogue_real"))))
				   (invoke "chmod" "+x" (string-append #$output "/bin/brogue"))
				   (copy-recursively "bin/assets" (string-append #$output "/share/assets"))
				   (make-desktop-entry-file
				    (string-append  #$output "/share/applications/brogue.desktop")
				    #:name "Brogue"
				    #:exec "brogue"
				    #:categories '("RolePlaying" "Game")
				    #:keywords
				    '("adventure" "singleplayer")
				    #:comment
				    '((#f "Brave the Dungeons of Doom!"))))))))
     (inputs (list (sdl-union (list sdl2 sdl2-image))))
     (synopsis "Brogue CE: A dungeon crawler roguelike")
     (description "Community fork of Brogue")
     (home-page "https://github.com/tmewett/BrogueCE")
     (license agpl3)))
#+end_src

I won't be digging deeper into the keys here now, but it's certainly very interesting to see how relatively simple and understandable the implementation is under the hood.

