_posts/2023-06-13-Guix_Dive.html

<div id="outline-container-org7714bdb" class="outline-2">
<h2 id="org7714bdb">Package record</h2>
<div class="outline-text-2" id="text-org7714bdb">
<p>
Let's look into the <code>package</code> record next. This one already looks very familiar to me, as I'm somewhat well versed in packaging for Guix by now.
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #707183;">(</span>define-record-type* <span style="color: #6434A3;">&lt;package&gt;</span>
  package make-package
  package?
  this-package
  <span style="color: #7388D6;">(</span>name   package-name<span style="color: #7388D6;">)</span>                   <span style="color: #8D8D84; font-style: italic;">; </span><span style="color: #8D8D84; font-style: italic;">string</span>
  <span style="color: #7388D6;">(</span>version package-version<span style="color: #7388D6;">)</span>               <span style="color: #8D8D84; font-style: italic;">; </span><span style="color: #8D8D84; font-style: italic;">string</span>
  <span style="color: #7388D6;">(</span>source package-source<span style="color: #7388D6;">)</span>                 <span style="color: #8D8D84; font-style: italic;">; </span><span style="color: #8D8D84; font-style: italic;">&lt;origin&gt; instance</span>
  <span style="color: #7388D6;">(</span>build-system package-build-system<span style="color: #7388D6;">)</span>     <span style="color: #8D8D84; font-style: italic;">; </span><span style="color: #8D8D84; font-style: italic;">&lt;build-system&gt; instance</span>
  <span style="color: #7388D6;">(</span>arguments package-arguments            <span style="color: #8D8D84; font-style: italic;">; </span><span style="color: #8D8D84; font-style: italic;">arguments for the build method</span>
             <span style="color: #909183;">(</span>default '<span style="color: #709870;">()</span><span style="color: #909183;">)</span> <span style="color: #909183;">(</span>thunked<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>

  <span style="color: #7388D6;">(</span>inputs package-inputs                  <span style="color: #8D8D84; font-style: italic;">; </span><span style="color: #8D8D84; font-style: italic;">input packages or derivations</span>
          <span style="color: #909183;">(</span>default '<span style="color: #709870;">()</span><span style="color: #909183;">)</span> <span style="color: #909183;">(</span>thunked<span style="color: #909183;">)</span>
          <span style="color: #909183;">(</span>sanitize sanitize-inputs<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span>propagated-inputs package-propagated-inputs    <span style="color: #8D8D84; font-style: italic;">; </span><span style="color: #8D8D84; font-style: italic;">same, but propagated</span>
                     <span style="color: #909183;">(</span>default '<span style="color: #709870;">()</span><span style="color: #909183;">)</span> <span style="color: #909183;">(</span>thunked<span style="color: #909183;">)</span>
                     <span style="color: #909183;">(</span>sanitize sanitize-inputs<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span>native-inputs package-native-inputs    <span style="color: #8D8D84; font-style: italic;">; </span><span style="color: #8D8D84; font-style: italic;">native input packages/derivations</span>
                 <span style="color: #909183;">(</span>default '<span style="color: #709870;">()</span><span style="color: #909183;">)</span> <span style="color: #909183;">(</span>thunked<span style="color: #909183;">)</span>
                 <span style="color: #909183;">(</span>sanitize sanitize-inputs<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>

  <span style="color: #7388D6;">(</span>outputs package-outputs                <span style="color: #8D8D84; font-style: italic;">; </span><span style="color: #8D8D84; font-style: italic;">list of strings</span>
           <span style="color: #909183;">(</span>default '<span style="color: #709870;">(</span><span style="color: #008000;">"out"</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>

                                                  <span style="color: #8D8D84; font-style: italic;">; </span><span style="color: #8D8D84; font-style: italic;">lists of</span>
                                                  <span style="color: #8D8D84; font-style: italic;">; </span><span style="color: #8D8D84; font-style: italic;">&lt;search-path-specification&gt;,</span>
                                                  <span style="color: #8D8D84; font-style: italic;">; </span><span style="color: #8D8D84; font-style: italic;">for native and cross</span>
                                                  <span style="color: #8D8D84; font-style: italic;">; </span><span style="color: #8D8D84; font-style: italic;">inputs</span>
  <span style="color: #7388D6;">(</span>native-search-paths package-native-search-paths <span style="color: #909183;">(</span>default '<span style="color: #709870;">()</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span>search-paths package-search-paths <span style="color: #909183;">(</span>default '<span style="color: #709870;">()</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>

  <span style="color: #8D8D84; font-style: italic;">;; </span><span style="color: #8D8D84; font-style: italic;">The 'replacement' field is marked as "innate" because it never makes</span>
  <span style="color: #8D8D84; font-style: italic;">;; </span><span style="color: #8D8D84; font-style: italic;">sense to inherit a replacement as is.  See the 'package/inherit' macro.</span>
  <span style="color: #7388D6;">(</span>replacement package-replacement                <span style="color: #8D8D84; font-style: italic;">; </span><span style="color: #8D8D84; font-style: italic;">package | #f</span>
               <span style="color: #909183;">(</span>default #f<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>thunked<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>innate<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>

  <span style="color: #7388D6;">(</span>synopsis package-synopsis
            <span style="color: #909183;">(</span>sanitize validate-texinfo<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>          <span style="color: #8D8D84; font-style: italic;">; </span><span style="color: #8D8D84; font-style: italic;">one-line description</span>
  <span style="color: #7388D6;">(</span>description package-description
               <span style="color: #909183;">(</span>sanitize validate-texinfo<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>       <span style="color: #8D8D84; font-style: italic;">; </span><span style="color: #8D8D84; font-style: italic;">one or two paragraphs</span>
  <span style="color: #7388D6;">(</span>license package-license                        <span style="color: #8D8D84; font-style: italic;">; </span><span style="color: #8D8D84; font-style: italic;">(list of) &lt;license&gt;</span>
           <span style="color: #909183;">(</span>sanitize validate-license<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span>home-page package-home-page<span style="color: #7388D6;">)</span>                   <span style="color: #8D8D84; font-style: italic;">; </span><span style="color: #8D8D84; font-style: italic;">string</span>
  <span style="color: #7388D6;">(</span>supported-systems package-supported-systems    <span style="color: #8D8D84; font-style: italic;">; </span><span style="color: #8D8D84; font-style: italic;">list of strings</span>
                     <span style="color: #909183;">(</span>default %supported-systems<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>

  <span style="color: #7388D6;">(</span>properties package-properties <span style="color: #909183;">(</span>default '<span style="color: #709870;">()</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>   <span style="color: #8D8D84; font-style: italic;">; </span><span style="color: #8D8D84; font-style: italic;">alist for anything else</span>

  <span style="color: #7388D6;">(</span>location package-location-vector
            <span style="color: #909183;">(</span>default <span style="color: #709870;">(</span>current-location-vector<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
            <span style="color: #909183;">(</span>innate<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>sanitize sanitize-location<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span>definition-location package-definition-location-code
                       <span style="color: #909183;">(</span>default <span style="color: #709870;">(</span>current-definition-location<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
                       <span style="color: #909183;">(</span>innate<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
<p>
So packages really are just bog standard records!
</p>

<p>
So yet again we can use this knowledge to do some fancy stuff. Let's check the inputs of the <code>curl</code> package as an example. 
</p>
<div class="org-src-container">
<pre class="src src-scheme">scheme@<span style="color: #707183;">(</span>guile-user<span style="color: #707183;">)</span>&gt; ,use<span style="color: #707183;">(</span>gnu packages curl<span style="color: #707183;">)</span>

scheme@<span style="color: #707183;">(</span>guile-user<span style="color: #707183;">)</span>&gt; <span style="color: #707183;">(</span><span style="color: #0000FF;">map</span> car <span style="color: #7388D6;">(</span>package-inputs curl<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
$14 = <span style="color: #707183;">(</span><span style="color: #008000;">"gnutls"</span> <span style="color: #008000;">"libidn"</span> <span style="color: #008000;">"mit-krb5"</span> <span style="color: #008000;">"nghttp2"</span> <span style="color: #008000;">"zlib"</span><span style="color: #707183;">)</span>
</pre>
</div>
<p>
Notice that I first had to import the correct module to get the <code>curl</code> definition. If you ever need to find which module contains a package, you can easily obtain this information using <code>guix show &lt;package&gt;</code>. 
</p>

<p>
Here's a fairly small package I wrote, you can see the practical usage of the record very clearly here.
You may be unfamiliar with a lot of these functions, but don't worry about that for now - just notice how the <code>package</code> record is used, that's the important part.
(also nevermind the ugly hacks, this is a package strictly for personal use&#x2026;).
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #707183;">(</span><span style="color: #0000FF;">define-public</span> <span style="color: #006699;">brogue-ce</span>
  <span style="color: #7388D6;">(</span>package
   <span style="color: #909183;">(</span>name <span style="color: #008000;">"brogue-ce"</span><span style="color: #909183;">)</span>
   <span style="color: #909183;">(</span>version <span style="color: #008000;">"1.12"</span><span style="color: #909183;">)</span>
   <span style="color: #909183;">(</span>source <span style="color: #709870;">(</span>origin
            <span style="color: #907373;">(</span>method url-fetch<span style="color: #907373;">)</span>
            <span style="color: #907373;">(</span>uri <span style="color: #6276BA;">(</span>string-append <span style="color: #008000;">"https://github.com/tmewett/BrogueCE/archive/refs/tags/v"</span> version
                                <span style="color: #008000;">".tar.gz"</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span>
            <span style="color: #907373;">(</span>sha256
             <span style="color: #6276BA;">(</span>base32
              <span style="color: #008000;">"0a6l7j91iq0mv7zrxnlxx6ll5rfwvgfyk5h1gc9m5qzll1n3zvdf"</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
   <span style="color: #909183;">(</span>build-system gnu-build-system<span style="color: #909183;">)</span>
   <span style="color: #909183;">(</span>arguments
    <span style="color: #709870;">(</span>list 
     <span style="color: #006FE0;">#:make-flags</span> #~<span style="color: #907373;">(</span>list <span style="color: #008000;">"CC=gcc"</span><span style="color: #907373;">)</span>
     <span style="color: #006FE0;">#:tests?</span> #f
     <span style="color: #006FE0;">#:phases</span>
     #~<span style="color: #907373;">(</span>modify-phases %standard-phases
                      <span style="color: #6276BA;">(</span>delete 'configure<span style="color: #6276BA;">)</span>
                      <span style="color: #6276BA;">(</span>add-before 'build 'change-datadir-path
                                  <span style="color: #858580;">(</span><span style="color: #0000FF;">lambda</span> _
                                    <span style="color: #80A880;">(</span><span style="color: #0000FF;">map</span>
                                     <span style="color: #887070;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #707183;">(</span>substitutes<span style="color: #707183;">)</span>
                                       <span style="color: #707183;">(</span>substitute* <span style="color: #008000;">"config.mk"</span>
                                                    <span style="color: #7388D6;">(</span><span style="color: #909183;">(</span><span style="color: #709870;">(</span>car substitutes<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
                                                     <span style="color: #909183;">(</span>cdr substitutes<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span><span style="color: #887070;">)</span>
                                     `<span style="color: #887070;">(</span><span style="color: #707183;">(</span><span style="color: #008000;">"^DATADIR := ."</span> . ,<span style="color: #7388D6;">(</span>string-append <span style="color: #008000;">"DATADIR := "</span> #$output <span style="color: #008000;">"/share"</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
                                       <span style="color: #707183;">(</span><span style="color: #008000;">"^RELEASE := NO"</span> . <span style="color: #008000;">"RELEASE := YES"</span><span style="color: #707183;">)</span><span style="color: #887070;">)</span><span style="color: #80A880;">)</span><span style="color: #858580;">)</span><span style="color: #6276BA;">)</span>
                      <span style="color: #6276BA;">(</span>replace 'install
                               <span style="color: #858580;">(</span><span style="color: #0000FF;">lambda</span> _
                                 <span style="color: #80A880;">(</span>mkdir-p <span style="color: #887070;">(</span>string-append #$output <span style="color: #008000;">"/bin"</span><span style="color: #887070;">)</span><span style="color: #80A880;">)</span>
                                 <span style="color: #80A880;">(</span>copy-file <span style="color: #008000;">"bin/brogue"</span> <span style="color: #887070;">(</span>string-append #$output <span style="color: #008000;">"/bin/.brogue_real"</span><span style="color: #887070;">)</span><span style="color: #80A880;">)</span>
                                 <span style="color: #80A880;">(</span><span style="color: #0000FF;">call-with-output-file</span> <span style="color: #887070;">(</span>string-append #$output <span style="color: #008000;">"/bin/brogue"</span><span style="color: #887070;">)</span> <span style="color: #8D8D84; font-style: italic;">; </span><span style="color: #8D8D84; font-style: italic;">Wrap around executable and execute in ~/.local</span>
                                   <span style="color: #887070;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #707183;">(</span>file<span style="color: #707183;">)</span>
                                     <span style="color: #707183;">(</span>format file <span style="color: #008000;">"~A"</span> <span style="color: #7388D6;">(</span>string-append
                                                        <span style="color: #008000;">"mkdir -p \"$HOME/.local/share/brogue\" &amp;&amp; cd \"$HOME/.local/share/brogue\" &amp;&amp; "</span>
                                                        #$output <span style="color: #008000;">"/bin/.brogue_real"</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span><span style="color: #887070;">)</span><span style="color: #80A880;">)</span>
                                 <span style="color: #80A880;">(</span>invoke <span style="color: #008000;">"chmod"</span> <span style="color: #008000;">"+x"</span> <span style="color: #887070;">(</span>string-append #$output <span style="color: #008000;">"/bin/brogue"</span><span style="color: #887070;">)</span><span style="color: #80A880;">)</span>
                                 <span style="color: #80A880;">(</span>copy-recursively <span style="color: #008000;">"bin/assets"</span> <span style="color: #887070;">(</span>string-append #$output <span style="color: #008000;">"/share/assets"</span><span style="color: #887070;">)</span><span style="color: #80A880;">)</span>
                                 <span style="color: #80A880;">(</span>make-desktop-entry-file
                                  <span style="color: #887070;">(</span>string-append  #$output <span style="color: #008000;">"/share/applications/brogue.desktop"</span><span style="color: #887070;">)</span>
                                  <span style="color: #006FE0;">#:name</span> <span style="color: #008000;">"Brogue"</span>
                                  <span style="color: #006FE0;">#:exec</span> <span style="color: #008000;">"brogue"</span>
                                  <span style="color: #006FE0;">#:categories</span> '<span style="color: #887070;">(</span><span style="color: #008000;">"RolePlaying"</span> <span style="color: #008000;">"Game"</span><span style="color: #887070;">)</span>
                                  <span style="color: #006FE0;">#:keywords</span>
                                  '<span style="color: #887070;">(</span><span style="color: #008000;">"adventure"</span> <span style="color: #008000;">"singleplayer"</span><span style="color: #887070;">)</span>
                                  <span style="color: #006FE0;">#:comment</span>
                                  '<span style="color: #887070;">(</span><span style="color: #707183;">(</span>#f <span style="color: #008000;">"Brave the Dungeons of Doom!"</span><span style="color: #707183;">)</span><span style="color: #887070;">)</span><span style="color: #80A880;">)</span><span style="color: #858580;">)</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
   <span style="color: #909183;">(</span>inputs <span style="color: #709870;">(</span>list <span style="color: #907373;">(</span>sdl-union <span style="color: #6276BA;">(</span>list sdl2 sdl2-image<span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
   <span style="color: #909183;">(</span>synopsis <span style="color: #008000;">"Brogue CE: A dungeon crawler roguelike"</span><span style="color: #909183;">)</span>
   <span style="color: #909183;">(</span>description <span style="color: #008000;">"Community fork of Brogue"</span><span style="color: #909183;">)</span>
   <span style="color: #909183;">(</span>home-page <span style="color: #008000;">"https://github.com/tmewett/BrogueCE"</span><span style="color: #909183;">)</span>
   <span style="color: #909183;">(</span>license agpl3<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
I won't be digging deeper into the keys here now, but it's certainly very interesting to see how relatively simple and understandable the implementation is under the hood.
</p>
</div>
</div>
