org/2023-06-13-Guix_Dive.org
* End of part 1
There's still a lot left to explore, but I think we all need a break now.  Next time I'll look deeper into the ~services~ section, and I'll show some more practical applications of what we've learned so far.


