_posts/2023-06-13-Guix_Dive.html

<div id="outline-container-orgf5cb206" class="outline-2">
<h2 id="orgf5cb206">End of part 1</h2>
<div class="outline-text-2" id="text-orgf5cb206">
<p>
There's still a lot left to explore, but I think we all need a break now.  Next time I'll look deeper into the <code>services</code> section, and I'll show some more practical applications of what we've learned so far.
</p>
</div>
</div>
